a
able
address
adult
adults
after
ahead
airplane
airport
am
an
ancient
and
animal
answering
any
apartment
apple
apples
april
are
arrive
arrives
arriving
art
at
ate
august
australia
baby
bakery
ball
bank
beach
beans
because
bed
beef
before
begin
beginning
begins
behind
beijing
bernard
beside
bethany
better
bicycle
big
biggest
birthday
blankets
blond
blue
bookstore
bought
boy
boys
breakfast
bring
brother
brought
building
bus
busy
but
butter
buy
buying
cafe
cake
call
calling
camera
camp
camping
can
car
carrots
cars
cash
cat
cats
cell
chair
chairs
chicken
child
children
china
chocolate
church
city
clean
clock
clothes
cloudy
coat
coffee
cold
college
come
coming
concert
cooked
cooking
cost
costs
country
credit
crying
cup
dance
dancer’s
dancers
dances
dancing
daughter
day
days
december
departs
desk
dessert
desserts
dictionary
did
didn’t
dinner
dirty
do
doctor
doctor’s
does
dog
doing
dollars
don’t
door
down
downtown
drank
dress
dresses
drink
drinking
drive
drives
driving
drove
drum
drums
e-mail
e-mails
early
eat
eating
eight
eighteen
eighty
elena
eleven
employees
end
ending
ends
english
euros
evening
excuse
expensive
factory
fairfield
families
family
far
fast
father
fifteen
fifteenth
fifth
fifty
finally
find
fine
first
fish
five
flight
flowers
foot
for
forty
foster
found
fountain
four
fourth
france
free
friday
friends
fruits
game
games
gas
gave
get
getting
girl
girls
give
gives
giving
glasses
go
goes
going
good
goodbye
grandfather
grandmother’s
grass
gray
green
guitars
had
hair
hand
hands
happy
hardware
has
have
he
he’s
hello
her
here
hi
high
hill
him
his
home
horse
hospital
hotel
hour
hours
house
hungry
husband
i
i’m
in
inside
instrument
instruments
is
island
islands
it
it’s
italy
january
japan
jean
jeans
jewelry
john
john’s
jones
juice
july
june
keys
kissed
kitchen
knife
know
ladder
lake
last
late
laura
laura’s
leaving
left
letter
letters
like
liked
likes
lime
line
listen
live
lives
living
long
looking
lost
lot
lunch
make
making
man
manager
map
march
math
means
medicine
men
mile
miles
mom
monday
month
moon
more
morning
mosque
most
mother
mountains
mr
museum
musician
name
new
night
notebook
number
ocean
office
old
oldest
on
one
or
orange
oranges
our
outside
p.m.
packed
packing
painting
paintings
parents
party
passport
pay
pen
person
pharmacy
phone
photo
photos
piano
plate
plates
play
plays
police
potato
rain
reading
rent
restroom
robert
russia
sail
salad
salt
same
sandwich
sandwiches
sarah
saturday
school
science
seat
second
seconds
see
sell
selling
september
seven
she
she’s
she’s
sheet
shirt
shoe
shoes
sign
sing
singer
singing
sings
sink
sister
sit
sitting
sixty
ski
skiers
skiing
skirt
sky
sleeping
slow
small
smiling
smith
smith’s
snow
snowing
soap
soccer
sock
socks
sold
some
something
sorry
soup
sour
speak
stadium
stairs
stamps
standing
start
starts
station
statue
statues
stay
staying
stop
store
straight
street
student
students
studies
study
studying
sue
sugar
suit
suitcase
suitcases
suits
summer
sunglasses
sunny
swim
swimming
swimsuit
swimsuits
synagogue
t-shirt
t-shirts
table
taking
talk
talking
tall
taught
taxi
tea
teach
teacher
television
temple
temples
ten
tennis
thank
that
the
their
them
then
there
these
they
they’re
thirsty
thirteenth
thirty
this
those
thousand
three
thursday
tickets
time
to
tomorrow
towel
tree
turning
types
unpacking
used
wait
walking
wants
wash
watched
we
we’re
wear
wearing
week
welcome
well
went
were
wet
what
what’s
when
where
which
white
why
wife
will
windy
winter
with
woman
women
woods
word
words
work
working
works
worse
worst
would
write
writes
writing
wrote
year
years
yellow
yen
yes
yesterday
you
you’re
younger
your
zoo
