a
a.m.
able
about
accident
achoo
actor
actress
add
added
adding
address
adult
adults
afraid
africa
after
afternoon
again
ago
ahead
airplane
airplanes
airport
airports
alejo
alex
alice
all
allergic
almost
alone
already
also
although
always
am
ambulance
american
amount
an
ancient
and
anderson
andy
angry
animal
animals
anna
anne
another
answer
answering
antarctica
any
anymore
anything
anyway
apartment
apple
apples
appointment
april
arabic
architect
architects
arctic
are
aren’t
arm
arrive
arrived
arrives
arriving
art
arthur
artificial
artist
as
asia
ask
asked
asking
assignment
astronomy
at
ate
atlantic
august
australia
babies
baby
baby’s
back
bad
badly
bake
baked
bakery
baking
balcony
ball
balls
banana
bananas
band
bank
barcelona
baseball
basket
basketball
bath
bathroom
battery
be
beach
bean
beans
beard
beards
beautiful
because
become
bed
bedran
bedroom
beds
bee
beef
been
bees
before
begin
beginning
begins
begun
behind
beijing
being
believe
belt
belts
benjamin
benson
bernard
beside
best
beth
bethany
better
between
bicycle
bicycles
big
bigger
biggest
bill
biography
biology
bird
birds
birthday
bit
bite
biting
black
blanket
blankets
bless
blizzard
blocks
blond
blue
boards
boat
bob
boiled
boiling
bone
bones
book
books
bookstore
boot
boots
bored
boring
born
borrow
borrowed
both
bottle
bottles
bought
bowl
bowls
box
boxes
boy
boyfriend
boys
bracelet
bracelets
brain
brazil
bread
breakfast
breaking
breathe
breathing
brick
bridge
bridges
bring
bringing
brings
british
brochure
brochures
broke
broken
brother
brothers
brought
brown
brush
brushing
bucket
build
building
buildings
built
bulldozer
bulldozers
burn
burned
burning
burns
bus
business
businessman
businessmen
businesswoman
businesswomen
busy
but
butter
button
buttoned
buttoning
buy
buying
by
cabinets
cafe
cake
calculator
call
called
calling
came
camels
camera
cameras
camp
camping
can
canceled
canceling
cans
can’t
car
card
careful
carrot
carrots
carry
carrying
cars
cart
carts
cash
cast
castle
cat
catch
catches
catherine
cats
caught
cave
caves
ceiling
celebrate
celebrating
cell
cells
century
cereal
chair
chairs
change
changed
changes
chapter
chapters
charge
charged
charging
cheat
cheating
check
checked
checking
checks
cheese
chemist
chemistry
chicken
chickens
child
children
china
chinese
chocolate
choked
choking
choosing
chose
christian
church
churches
cindy
citizen
citizens
city
clark
class
clean
cleaned
cleaner
cleaners
cleaning
clear
clerk
clerks
client
climb
climbed
climbing
clock
close
closed
closet
closing
clothes
cloudy
coal
coat
coats
coffee
coins
cold
college
collided
color
colors
come
comedy
comes
coming
company
complex
computer
computers
concert
condolences
confused
congratulations
continent
continents
cook
cooked
cooking
cooks
corn
cost
costs
couch
could
counter
countries
country
course
cousin
cousins
cow
cows
crane
cranes
cream
credit
cry
crying
culture
cup
cups
curly
customer
customers
cut
cutting
da
dad
dairy
damage
damaged
dan
dance
dancers
dancer’s
dances
dancing
dangerous
daniel
dark
date
daughter
david
day
days
dead
december
decreased
degrees
delayed
deliver
delivery
depart
departed
department
departs
depend
depends
desert
design
designs
desk
desktop
despite
dessert
desserts
destroyed
diamond
diamonds
dictionary
did
didn’t
different
difficult
digging
dining
dinner
dirt
dirty
disagree
discover
discovered
discovers
dishes
divide
dividing
divorced
do
doctor
doctors
doctor’s
dodd
does
doesn’t
dog
dogs
doing
doll
dollars
dolls
donate
donating
done
donkey
donkeys
don’t
door
doubt
down
downtown
drank
draw
drawer
drawing
drawn
dress
dresses
drew
drink
drinking
drinks
drive
driven
drives
driving
dropped
drought
drove
drum
drums
drunk
dry
dryer
duck
ducks
due
during
dye
dyed
dying
e-mail
e-mails
each
ear
earlier
early
earrings
earth
earthquakes
east
eastern
easy
eat
eaten
eating
eats
egg
eggs
egypt
eight
eighteen
eighteenth
eighty
either
elbow
elbows
election
electrical
electricity
elena
elephant
elephants
elevator
eleven
ellis
elm
embarrassed
embassy
emergencies
emergency
emi
emily
employee
employees
empty
end
ended
ending
ends
energy
engine
engineer
english
enjoys
enough
enter
entering
entrance
envelope
escalator
escalators
europe
european
euros
evening
ever
everest
every
everyone
exam
excellent
except
exchange
exchanged
excited
excuse
exercise
exercises
exercising
exit
exiting
exits
expensive
experiments
explore
explored
exploring
extinguisher
extra
eye
eyes
face
faces
factories
factory
fail
failed
fairfield
fall
falls
families
family
famous
far
farm
farmer
farmers
fashion
fast
faster
fastest
father
favorite
feed
feeding
feel
feet
feldmann
fell
felt
festival
fever
feverish
few
fiction
fields
fifteen
fifteenth
fifth
fifty
fighting
finally
find
fine
finger
fingers
finish
finished
finishes
fire
fireplace
fires
first
fish
fishing
fit
fits
five
flag
flags
flashlight
flashlights
flat
flight
flood
floor
flour
flower
flowers
fly
flying
folded
folding
follow
followed
following
follows
food
foot
for
forest
forget
forgot
forgotten
fork
forklift
forklifts
forks
fortunate
fortunately
forty
foster
fought
found
fountain
four
fourteen
fourth
france
frank
free
french
fresh
friday
fried
friend
friends
frog
from
front
frozen
fruit
fruits
frying
full
fun
funeral
funny
future
game
games
garden
gardens
garlic
gas
gave
german
germans
germany
get
getting
gift
girl
girlfriend
girls
give
gives
giving
glass
glasses
glove
gloves
go
goat
goats
goes
going
gold
golf
gone
good
goodbye
got
graduate
graduated
grandchildren
grandfather
grandma
grandmother
grandmother’s
grandparents
grandson
grass
gray
green
grilled
grilling
grocery
group
groups
grow
growing
grown
grows
guest
guests
guide
guitar
guitars
gunther
gwen
had
haddad
hair
half
hammer
hammers
hand
hands
hanging
hangs
happen
happened
happens
happy
hardware
harvest
has
hasn’t
hat
have
haven’t
he
head
headphones
heads
heal
healed
healing
heals
hear
hears
heavy
helicopter
hello
helmets
help
helping
helps
her
here
here’s
hers
he’ll
he’s
hi
high
hiking
hill
him
hiro
his
history
hobbies
hobby
hockey
hold
holding
holidays
home
honey
hood
hope
hopes
horse
horses
hospital
hot
hotel
hour
hours
house
houses
how
hugging
hundred
hungry
hurricane
hurt
hurts
husband
i
ice
idea
if
illegal
imagine
imagined
imagines
imagining
important
in
inch
inches
incorrectly
india
indian
industry
information
injection
injections
injury
insect
insects
inside
instead
instrument
instruments
interested
interesting
intersection
into
iron
ironed
ironing
irons
is
isabella
island
islands
isn’t
it
italian
italians
italy
its
it’ll
it’s
i’ll
i’m
i’ve
jack
jacket
jackets
james
jane
january
japan
japanese
jean
jeans
jeff
jewelry
jill
joan
job
joel
johann
john
john’s
jones
josephine
josh
juice
julia
july
jump
jumped
jumping
june
just
key
keys
kilometers
king
kings
kingston
king’s
kissed
kitchen
kites
knee
knees
knife
knives
know
knows
label
laboratory
ladder
lake
lamb
lamp
language
languages
laptop
larson
last
late
later
laugh
laura
laura’s
law
lawyer
lawyers
leak
leaking
learn
learning
least
leather
leave
leaves
leaving
left
leg
legs
lemon
lemons
lending
lens
lenses
lent
leonardo
less
lets
letter
letters
let’s
levy
li
libraries
library
lie
life
lifting
light
lighter
lightest
lights
like
liked
likes
lima
lime
limes
lin
line
listen
listening
little
live
lived
lives
living
load
loaded
loading
lobby
lock
locked
locker
lockers
london
long
look
looked
looking
looks
lose
losing
lost
lot
loud
louise
love
loves
lumber
lunch
made
magazine
mailbox
make
makes
makeup
making
mall
man
manager
managers
manufacture
manufactured
manufactures
manufacturing
many
man’s
map
maps
march
maria
maria’s
market
married
marry
mary
math
matter
may
maybe
me
mean
means
measuring
meat
mechanic
medicine
medium
mediums
meet
meeting
men
menu
menus
message
met
metal
mexican
mexicans
mexico
michael
microscope
microscopes
midnight
might
mike
mile
miles
milk
mine
mining
minor
minutes
mirror
miss
mistake
mistakes
modern
mom
monday
money
monkey
monkeys
month
months
moon
mop
more
morning
moscow
mosque
most
mother
mothers
motorboats
motorcycle
mountain
mountains
mouth
move
moved
movie
movies
mr
mr.
ms.
much
multiply
museum
mushrooms
music
musician
muslim
my
nail
nails
name
naomi
near
necklace
needs
never
new
nice
night
nine
nineteen
nineteenth
no
none
noon
nor
normal
north
not
notebook
nothing
novel
now
number
nurses
nuts
ocean
of
off
office
officer
often
ogpin
oil
okay
old
older
oldest
on
once
one
ones
onions
only
onto
open
opens
or
orange
oranges
order
ordered
other
our
ours
out
outside
oven
over
owned
owns
p.m.
pacific
package
packages
packed
packing
page
pages
paint
painting
paintings
pants
paper
paramedic
paramedics
parents
paris
park
parker
parking
part
parts
party
passed
passenger
passengers
passing
passport
past
pasta
patient
patients
pay
paying
peace
pen
pencils
penguin
people
pepper
person
pharmacy
phone
phones
photo
photographer
photography
photos
piano
pianos
pick
picking
pie
pilot
pink
pipe
pipes
pirelli
pizza
place
plan
plane
planet
planning
plant
plants
plate
plates
play
played
player
players
playing
plays
plumber
police
pork
post
pot
potato
potatoes
pounds
problems
produced
psychology
pull
pulling
purse
push
pushing
put
puts
putting
puzzle
question
questions
race
radio
rain
rained
raise
raises
rarely
rash
read
reading
reads
ready
real
realized
really
rebecca
receipt
receive
received
receiving
receptionist
recommend
recycle
recycled
recycling
red
reem
refrigerator
register
remarried
remember
remembered
rent
renting
repair
repaired
repairing
repeat
replace
represent
representative
represented
represents
reservations
restaurant
restroom
return
returns
reynolds
rice
richardson
ride
riding
right
rings
ripe
river
robert
rode
romance
romantic
rome
roof
roofs
room
rope
ropes
rose
rosetta
rowboat
rowboats
rugs
ruins
run
running
runs
russia
russian
sad
safe
safer
said
sail
sailboat
sailed
sailing
salad
sale
salt
same
sand
sandwich
sandwiches
sara
sarah
sat
saturday
saturdays
sauce
save
saved
saves
saving
saw
say
says
scale
scary
school
science
scientist
scientists
screaming
sculpting
sculptor
sculpture
seafood
seat
seated
second
seconds
section
see
seeds
sees
sell
selling
sells
send
sent
september
serious
seven
seventy
sew
sewing
sews
share
shared
sharing
shark
sharks
shave
shaved
shaving
she
sheet
sheets
she’ll
she’s
ship
shirt
shoe
shoes
shop
shopping
short
should
shovel
show
shower
showing
sick
side
sign
signing
signs
silk
silom
silver
simple
since
sing
singer
singers
singing
single
sings
sink
sirius
sister
sisters
sit
sits
sitting
six
sixteen
sixteenth
sixty
size
sizes
ski
skiers
skiing
skirt
skirts
skis
sky
sleep
sleeping
slept
slice
slices
slow
slower
small
smallest
smell
smells
smiling
smith
smith’s
smoke
snake
snakes
snow
snowing
so
soap
soccer
sock
socks
soda
sold
soldier
soldiers
solve
solved
solving
some
someday
something
sometimes
son
sons
son’s
soon
sorry
soup
sour
south
spain
speak
speaking
speaks
spend
spent
spilled
spilling
spoons
spring
stadium
stairs
stamp
stamps
standing
star
stars
start
started
starting
starts
station
statue
statues
stay
staying
steal
stealing
steel
still
stir
stirring
stirs
stole
stolen
stop
stoplight
stopped
stopping
stops
store
stories
story
straight
street
strong
student
students
studied
studies
study
studying
sue
sugar
suit
suitcase
suitcases
suits
summer
sun
sunday
sunglasses
sunny
sunrise
sunset
surprise
surprised
susan
suzanne
sweater
sweep
sweet
swept
swim
swimming
swimsuit
swimsuits
swollen
synagogue
t-shirt
t-shirts
table
tables
take
taken
takes
taking
talk
talked
talking
tall
tanaka
tape
taste
tastes
taught
taxi
taxis
taylor
tea
teach
teacher
teaches
teaching
team
teaspoons
teeth
telescope
television
telling
temperature
temple
temples
ten
tennis
tent
tenth
than
thank
that
that’s
the
theater
their
them
then
there
there’s
thermometer
these
they
they’ll
they’re
thief
thieves
think
thinks
third
thirds
thirsty
thirteenth
thirty
this
those
thought
thousand
three
through
throw
thursday
ticket
tickets
tie
tiger
tigers
time
times
tip
tire
tired
tires
to
today
together
toilet
told
tom
tomato
tomatoes
tomorrow
tonight
too
toothpaste
tore
torn
tornado
touch
touching
tour
tours
towel
toy
toys
tractor
tractors
traditional
train
translate
translates
translating
translator
transport
transportation
transporting
trash
traveled
traveling
treat
treated
treating
tree
tried
truck
trucks
truth
try
trying
turned
turning
twelve
twenty
twin
twins
two
type
types
umbrella
unclear
uncles
under
understand
united
unless
unpacking
until
us
used
uses
using
vacations
van
vegetables
very
video
violin
violins
visit
visiting
visits
volcano
vote
wait
waiting
waitress
walk
walking
wall
wallet
want
wants
war
wars
was
wash
washing
wasn’t
watch
watched
watches
watching
water
waterfalls
we
wear
wearing
wears
weather
website
wedding
wednesday
week
weeks
welcome
well
went
were
weren’t
west
wet
we’ll
we’re
we’ve
whale
what
what’s
wheat
wheeler
when
where
where’s
which
while
white
who
whole
why
wide
wife
will
williams
wilson
win
window
windows
windy
winning
wins
winter
wire
wires
with
without
woke
woman
woman’s
women
won
won’t
wood
wooden
woods
wool
word
words
wore
work
worked
worker
workers
working
works
worn
worried
worry
worse
worst
would
wouldn’t
wrench
wrenches
write
writes
writing
written
wrong
wrote
x-ray
x-rays
yard
year
years
yellow
yen
yes
yesterday
you
young
younger
youngest
your
yours
you’ll
you’re
you’ve
zoo
