a
ancient
and
angry
animal
animals
another
answer
any
anymore
apples
are
aren’t
arm
art
artificial
as
ask
asked
asking
assignment
astronomy
about
accident
actor
add
adding
address
adult
afraid
after
ago
ahead
airplane
airplanes
airport
all
almost
alone
already
always
am
ambulance
american
amount
an
atlantic
back
badly
basket
beautiful
become
bee
been
bees
before
begun
behind
being
belt
benson
between
bicycle
big
biography
biology
bit
bite
biting
black
blizzard
blocks
blond
blue
bob
bone
bones
book
books
boots
born
borrow
borrowed
both
bottles
bought
boxes
boy
boys
brain
brazil
bread
breaking
breathe
breathing
brick
bridge
bring
bringing
british
brochure
brochures
broke
broken
brothers
brought
brown
build
built
bulldozer
bulldozers
burned
burning
burns
business
businessman
businessmen
busy
but
butter
buy
by
cake
calculator
call
calling
came
camera
camp
camping
can
can’t
canceled
canceling
cans
car
careful
carrot
carry
carrying
cars
cart
carts
cash
cast
cat
cats
cave
cell
cells
century
chair
change
changed
changes
chapter
chapters
cheat
cheating
check
checked
checking
cheese
chemist
chemistry
chicken
chickens
child
children
chinese
choked
choking
citizen
citizens
class
clean
clear
clerk
clerks
climbed
climbing
closed
clothes
cloudy
coal
coat
coffee
college
collided
color
colors
come
comedy
comes
coming
complex
computer
concert
confused
congratulations
continents
cook
cooking
corn
cost
costs
couch
could
countries
course
cousin
cousins
crane
cranes
cream
cry
culture
cup
curly
customer
customers
cut
dad
damage
damaged
dangerous
dark
date
day
decreased
degrees
deliver
delivery
departed
department
departs
depend
depends
design
designs
desk
despite
destroyed
diamond
diamonds
did
didn’t
different
difficult
digging
dinner
dirt
dirty
discover
discovered
discovers
dishes
divide
dividing
divorced
do
doctor
doctors
does
dollars
dolls
don’t
donate
donating
done
donkey
donkeys
door
doubt
down
downtown
drawing
dress
dresses
drink
drive
driving
dropped
drought
drunk
dryer
duck
ducks
due
during
each
earlier
early
earth
earth
earthquakes
easy
eat
eating
egg
eggs
eight
eighteenth
eighty
either
election
electrical
electricity
elephant
elevator
embarrassed
embassy
embassy
emergencies
emergency
employees
end
energy
engine
english
enjoys
enough
entering
entrance
europe
european
euros
evening
ever
everest
every
everyone
exam
excellent
except
excited
excuse
exercises
exit
exits
expensive
experiments
explore
explored
extinguisher
extra
eyes
face
factories
factory
fail
failed
fall
family
famous
far
farm
farmer
farmers
fashion
fast
fastest
father
feed
feeding
feel
feet
fell
felt
fever
feverish
few
fiction
fifteen
fifty
fighting
find
fine
finger
finish
finished
finishes
fire
fireplace
fires
first
fishing
fit
five
flag
flat
flight
flood
floor
flour
flower
flowers
fly
folded
follow
followed
follows
food
for
forest
forget
forgot
forklift
forklifts
fortunate
fortunately
found
four
fourteen
fourth
france
french
fresh
friday
friend
friends
frog
from
front
full
fun
funny
future
game
garden
german
germany
get
gift
girl
give
giving
glass
go
goat
goats
going
gold
golf
gone
good
got
graduate
graduated
grandchildren
grandmother
grandson
grass
green
grocery
group
groups
grow
grown
grows
guitar
gwen
had
hair
hand
hands
happen
happened
happens
happy
harvest
has
hasn’t
have
haven’t
he’ll
he’s
head
heal
healed
hear
heavy
helicopter
hello
help
helping
helps
her
here
here’s
high
hiking
hill
him
history
hobbies
hobby
hockey
hold
holding
home
honey
hope
horses
hospital
hotel
hours
house
houses
how
hundred
hungry
hurricane
hurt
hurts
husband
i
i’ll
i’m
i’ve
ice
idea
if
illegal
imagine
imagined
imagines
imagining
important
in
inch
inches
india
industry
information
injection
injections
injury
insects
inside
instead
interested
interesting
into
is
islands
isn’t
it
it’ll
it’s
italian
jane
january
japan
japanese
jeans
joan
job
john
josephine
josh
juice
julia
july
jump
just
keys
kitchen
knee
know
laboratory
lake
lamp
larson
last
late
later
laugh
law
lawyer
lawyers
leaking
learn
least
leaving
left
leg
lemons
lending
lent
less
let’s
lets
letter
library
lie
life
lifting
light
lights
like
liked
likes
listen
listening
little
live
lived
lives
living
load
loaded
loading
locked
london
long
look
looked
looking
looks
lose
lost
lot
loves
lumber
lunch
made
make
makes
making
mall
man
managers
manufacture
manufactured
manufactures
manufacturing
many
maps
market
married
marry
mary
math
matter
maybe
means
medicine
medium
mediums
meet
meeting
men
met
mexico
microscope
microscopes
midnight
might
milk
mining
minor
minutes
mirror
miss
mistake
mistakes
modern
money
month
months
moon
more
morning
moscow
most
mother
mountain
move
moved
movies
multiply
name
necklace
needs
new
nice
nineteenth
no
noon
nor
normal
not
nothing
novel
now
number
nurses
nuts
ocean
of
off
officer
often
oil
okay
on
one
only
onto
opens
or
oranges
order
ordered
other
our
outside
over
owned
owns
package
packages
page
pages
paint
painting
pants
paper
paramedic
paramedics
parents
paris
park
part
parts
party
passed
passenger
passengers
passport
past
pasta
patient
patients
pay
paying
peace
pencils
penguin
people
person
phone
photo
photographer
photography
photos
piano
pilot
pipes
place
plan
plane
planet
planning
plant
plants
plate
plates
play
played
plays
plumber
police
pork
problems
produced
psychology
pull
pulling
purse
push
pushing
put
puzzle
question
questions
race
radio
rain
rained
raise
raises
rarely
rash
read
real
realized
really
receipt
received
receiving
receptionist
recommend
recycle
recycled
recycling
red
register
remarried
remember
remembered
rent
renting
repair
repairing
replace
represent
representative
represented
represents
reservations
restaurant
return
rice
ride
right
ripe
romance
romantic
roof
room
run
running
runs
russia
russian
sad
safe
safer
said
sailing
salad
sale
same
sand
sandwich
saturday
sauce
save
saved
saves
saving
saw
says
scary
school
science
scientists
screaming
sculpting
sculptor
sculpture
seafood
see
seeds
sees
sell
sells
serious
seventy
share
shared
sharing
shark
shave
shaving
she
she’ll
she’s
ship
shirt
shoes
shop
shopping
should
shovel
show
showing
sick
side
sign
signs
simple
since
singer
singers
singing
single
sink
sirius
sister
sit
sitting
six
size
ski
skiers
skiing
sleep
sleeping
slept
slice
small
smiling
smoke
snake
snow
snowing
so
soccer
socks
soda
soldier
soldiers
solve
solved
solving
some
someday
something
son
soon
sorry
soup
speaks
spend
spent
spilled
spilling
spring
star
stars
start
started
starting
starts
statue
statues
stay
steal
stealing
steel
still
stole
stolen
stop
stopped
stops
store
stories
story
straight
street
strong
student
students
studied
studies
study
studying
suitcase
suitcases
summer
sunday
sunglasses
sunny
sunrise
sunset
surprised
susan
swim
take
taken
takes
taking
talking
tall
tanaka
taste
taught
taylor
tea
teach
teacher
teaches
teaching
team
teeth
telescope
television
telling
temperature
ten
tennis
than
thank
that
that’s
the
theater
their
them
then
there
there’s
these
they
they’ll
they’re
thief
thieves
think
thinks
third
thirty
this
those
thought
three
through
ticket
tigers
tigers
time
times
tired
to
toys
tractor
tractors
traditional
train
translate
translates
translating
translator
transport
transportation
transporting
trash
traveled
traveling
treat
treated
treating
tree
tried
truck
trucks
truth
try
trying
turning
twelve
twenty
twin
twins
two
type
types
unclear
uncles
under
together
told
tomato
tomatoes
tomorrow
too
toothpaste
torn
tornado
touching
tour
toy
understand
unless
uses
vacations
video
visits
waitress
wants
war
wars
was
washing
wasn’t
watch
watches
watching
we
we’re
wear
wears
weather
week
weeks
welcome
well
went
weren’t
wet
whale
what
what’s
wheat
when
where
where’s
which
while
who
why
wife
will
williams
wilson
win
window
windy
winning
wins
winter
wires
with
woke
woman
women
won
won’t
wood
woods
words
wore
work
worked
worker
workers
working
worn
worried
worry
would
wouldn’t
written
x-ray
x-rays
yard
year
years
yes
without
yesterday
you
you’ll
you’ve
young
younger
youngest
your
zoo
