a
adults
after
afternoon
am
an
and
animals
anna
anne
apartment
apple
apples
are
australia
babies
baby
bad
bakery
ball
balls
because
bed
beds
before
beijing
belts
bicycle
bicycles
big
bigger
biggest
black
blond
blue
book
books
bowl
bowls
boy
boys
bread
breakfast
bridge
broken
brother
brown
brush
brushing
but
buying
cake
car
card
carrot
carrots
cars
cash
cat
cats
chair
chairs
check
checks
child
children
chinese
chocolate
city
clark
clean
closed
clothes
coat
coffee
coins
cold
color
colors
comes
computer
computers
concert
cook
cooking
cost
country
credit
cup
dan
daughter
david
day
days
desktop
different
dining
dinner
dirty
do
doctor
doctors
does
doesn’t
dog
dogs
doing
dollars
don’t
door
drink
drinking
drinks
driving
dry
eat
eating
egg
egypt
eight
eight
eighteen
eleven
elm
english
euros
evening
excuse
face
faces
fall
family
fast
faster
father
fifty
fine
fingers
fish
fit
fits
five
flower
flowers
foot
forty
four
france
friday
friend
from
fruit
game
girl
girls
glasses
golf
good
goodbye
grandma
grandmother
grass
gray
green
guest
guests
haddad
hair
hand
hands
hardware
has
hat
have
he
he’s
heavy
hello
his
horse
horses
hospital
hotel
house
how
hugging
hungry
husband
i
i’m
in
inside
is
isabella
it
it’s
italy
jane
japan
jeans
jewelry
john
jones
juice
keys
kitchen
laptop
least
less
levy
li
light
lighter
lightest
like
likes
lima
lin
listen
listening
live
lives
living
loves
lunch
man
many
me
meat
medicine
meet
men
metal
michael
mike
milk
mom
monday
movie
name
new
night
nineteen
none
of
older
open
outside
parker
people
pink
play
police
pounds
radio
reads
reem
rome
run
russia
same
sandwich
sandwiches
sarah
school
sells
seven
she
she’s
sheet
sheets
shirt
shoe
shoes
short
sink
sister
sitting
sixteen
sixty
size
sizes
skirt
sky
sleeping
slow
slower
small
smallest
smell
smells
smith
soap
soccer
socks
son
sons
speak
speaking
speaks
spring
standing
store
street
street
student
students
studying
sue
suit
suits
summer
sun
sunday
sunglasses
sweater
swim
swimming
t-shirt
t-shirts
table
tables
tall
taste
tastes
taylor
tea
teacher
teaching
teeth
television
ten
than
thank
the
their
them
there
these
thirsty
thursday
tired
too
toys
umbrella
united
vegetables
watches
watching
we’re
wearing
welcome
wet
what
when
where
white
who
why
window
winter
with
wooden
work
works
write
writing
years
yellow
yes
you
you’re
younger
youngest
your
