a
about
add
added
adding
address
adults
afraid
africa
again
ago
airplane
airport
alex
all
almost
already
also
always
am
an
and
animal
animals
answering
antarctica
any
apple
arabic
arctic
are
arm
as
atlantic
australia
baby’s
bake
balls
bean
bed
before
begins
behind
beijing
believe
beside
better
bicycle
big
bigger
bird
birds
birthday
black
books
boring
born
box
boyfriend
brazil
bread
bring
brother
brought
build
building
built
bus
businessman
businessmen
businesswoman
businesswomen
but
butter
buy
by
cafe
cake
called
camels
camera
cameras
camp
can
can’t
car
careful
carrots
carry
cash
cat
catch
catches
caught
cell
chair
chairs
cheese
chicken
child
children
china
choosing
chose
christian
church
city
clean
cleaned
cleaner
cleaning
climb
climbing
clock
closed
clothes
coat
coats
coffee
cold
college
come
coming
company
computer
computers
concert
condolences
congratulations
continent
continents
cook
cooking
cooks
cost
couch
counter
country
cow
cows
cup
cups
cut
cutting
dad
dad
dance
dances
dancing
daniel
daughter
day
days
dead
degrees
delayed
depart
departed
departs
desert
dessert
dictionary
did
different
difficult
dinner
dirty
disagree
discovered
dishes
do
doctor
doctor’s
dodd
does
doesn’t
dog
dogs
doing
don’t
door
downtown
dress
drink
drinking
drive
driven
drove
drums
drunk
duck
ducks
during
e-mails
each
early
east
eastern
easy
eat
eaten
eating
eats
eggs
egypt
eight
eighty
elbows
election
elephant
elephants
eleven
emily
empty
ended
english
enough
euros
ever
everyone
exchange
exchanged
excuse
exercise
exercises
exercising
eye
eyes
face
fall
families
family
far
fast
faster
father
fell
fifteen
fifty
finally
find
finger
finish
finished
fire
first
fit
fits
five
flags
flashlight
flight
floor
flower
flowers
flying
food
for
forest
forgot
forgotten
fork
forks
forty
fought
found
four
france
frank
free
french
fresh
friday
friend
frog
from
frozen
fruit
full
funeral
game
games
garden
gave
german
germans
germany
get
getting
girl
girlfriend
girls
give
gives
glass
go
going
golf
good
got
grandfather
grandparents
grass
gray
green
grocery
grow
growing
grows
guests
guitar
hair
half
hammer
hammers
hands
happened
happy
has
hat
have
head
heads
hello
help
helping
her
here
hers
hi
him
his
hold
holding
holidays
home
hope
hopes
horse
hospital
hot
hours
house
how
hundred
hungry
hurts
i’m
ice
if
in
inches
india
indian
insects
inside
into
is
island
it
it’s
italian
italians
italy
jane
japan
jeans
jewelry
joel
johann
john
juice
julia
july
jump
jumped
jumping
key
keys
king
king’s
kitchen
knee
knees
knife
know
knows
ladder
lake
language
languages
laptop
last
learn
learning
least
leave
leaving
left
leg
legs
lemon
less
letter
letters
library
like
liked
likes
limes
line
listen
listening
little
lived
long
look
looks
lose
losing
lost
louise
love
lunch
made
make
making
man’s
manager
many
maria
maria’s
married
math
maybe
me
measuring
meat
medicine
meet
met
mexican
mexicans
mexico
milk
mom
monday
money
monkey
monkeys
month
months
moon
more
mosque
most
mother
mothers
mountain
mountains
mouth
movie
much
museum
music
muslim
my
nail
nails
name
near
needs
never
new
nice
north
nothing
number
off
okay
once
ones
onto
oranges
ours
pacific
packing
paintings
passport
pepper
photos
pizza
plays
police
potatoes
pounds
putting
rained
ready
refrigerator
repaired
riding
rosetta
rugs
run
said
salt
sand
scale
science
sell
seventy
shark
sharks
she
she’s
sheet
sheets
shirt
shoe
shoes
shopping
short
should
shower
sign
since
sink
sits
sitting
sixty
size
ski
skirts
skis
sleeping
slice
slices
small
smallest
smell
smells
smith
snake
snakes
snow
sock
someday
sometimes
son’s
south
spain
speaking
statues
studying
sue
sugar
suit
suitcase
sunglasses
sunny
suzanne
sweater
sweep
sweet
swept
swim
swimming
table
take
taken
taking
talk
talked
talking
tall
tape
taste
tastes
taught
taxis
taylor
tea
teach
teacher
teaching
team
teaspoons
teeth
television
temple
tennis
tent
than
thank
that
that’s
the
the
theater
them
then
there
there’s
thermometer
these
they’re
think
thinks
third
thirds
thirsty
thirty
this
those
thousand
three
throw
tiger
tigers
time
times
tired
to
today
toilet
tom
tomato
tomatoes
tomorrow
touch
touching
towel
toy
toys
train
trash
tree
twelve
twenty
types
under
united
using
violin
vote
wants
wash
water
we’re
wearing
wednesday
weeks
went
west
wheeler
while
whole
wide
wilson
win
winning
wins
winter
woman
woman’s
women
won
woods
work
working
works
worn
would
wrench
writing
written
wrong
wrote
year
years
yen
yes
yesterday
you
you’re
your
yours
