a
anderson
andy
angry
animal
animals
antarctica
any
anything
anyway
apartment
apple
apples
appointment
architect
architects
are
aren’t
arm
arrived
art
arthur
artist
asia
ask
ate
australia
babies
baby
bad
badly
baked
baking
a.m.
able
about
achoo
actor
actress
add
address
adult
adults
afraid
africa
after
ago
airplane
airplanes
airport
airports
alejo
alice
all
allergic
almost
alone
already
although
always
american
an
ancient
and
balcony
banana
bananas
band
barcelona
baseball
basketball
bath
bathroom
battery
be
beans
beard
beards
beautiful
because
bed
bedran
bedroom
been
before
begin
begins
begun
behind
benjamin
best
beth
bicycle
bill
bird
birthday
blanket
bless
blocks
blond
blue
boards
boat
boiled
boiling
book
boot
boots
bored
born
both
bottle
bottles
bought
bowls
box
boxes
boy
boys
bracelet
bracelets
brazil
bread
breakfast
bridge
bridges
bring
bringing
brings
brochure
broke
brother
brothers
brought
bucket
build
building
buildings
built
burn
burned
burning
bus
but
butter
button
buttoned
buttoning
buy
by
cabinets
cafe
cake
calling
came
can
can’t
car
card
careful
carrying
cars
cast
castle
cat
catch
catherine
cats
caught
cave
caves
ceiling
celebrate
celebrating
cell
century
cereal
chair
charge
charged
charging
check
chicken
children
choosing
church
churches
cindy
city
clark
clean
cleaners
client
climb
climbing
clock
close
closed
closet
closing
clothes
coming
cooking
cost
crying
cut
da
dairy
date
day
degrees
delivery
desert
design
designs
did
didn’t
dinner
dirty
dishes
do
doctor
does
dog
dogs
doll
dollars
dolls
don’t
door
down
draw
drawer
drawing
drawn
dress
dresses
drew
drink
drinking
drive
drives
driving
drove
drunk
dry
dry
dryer
ducks
during
dye
dyed
dying
e-mail
ear
earrings
eat
eating
egg
eggs
eight
either
elbow
elevator
ellis
embarrassed
emi
employee
employees
empty
engine
engineer
english
enter
entering
envelope
escalator
escalators
europe
euros
evening
everyone
excuse
exiting
expensive
exploring
eye
face
falls
family
far
faster
father
favorite
feldmann
fell
festival
festival
fever
fields
fifteen
fifty
fighting
finally
find
fine
fingers
finish
finished
fireplace
first
fish
fishing
five
flashlight
flashlights
flat
floor
flowers
folded
folding
follow
following
food
for
forest
forget
forgot
found
four
fourth
france
french
fresh
friday
fried
friend
from
frozen
fruit
frying
full
fun
game
games
garden
gardens
garlic
gave
germany
get
gift
girl
girlfriend
give
gives
giving
glass
glasses
glove
gloves
go
goes
going
gold
golf
good
got
grandfather
gray
green
grilled
grilling
grocery
guest
guide
guitars
gunther
had
hair
half
hand
hands
hanging
hangs
happen
happened
happy
has
hat
have
he
he’s
headphones
heal
healed
healing
heals
hears
hello
helmets
help
her
here
hi
hiking
him
hiro
his
history
hobbies
hobby
hockey
home
hood
hope
horse
horses
hospital
hot
hotel
hour
hours
house
how
hungry
hurt
hurts
husband
i
isn’t
it
it’ll
it’s
italian
italy
its
jack
jacket
jackets
james
january
japan
japanese
jeff
jewelry
jill
job
john
juice
julia
jump
jumped
jumping
june
just
key
keys
kilometers
kings
kingston
kissed
kitchen
kites
knee
knife
knives
i’m
i’ve
i’ve
ice
idea
if
important
in
incorrectly
insect
insects
inside
instead
interesting
intersection
into
iron
ironed
ironing
irons
is
know
knows
label
ladder
lake
lamb
lamp
laptop
last
laugh
leak
leaking
learn
leather
leave
leaves
leaving
left
lemon
lens
lenses
leonardo
less
let’s
libraries
library
light
like
liked
likes
listening
live
lived
lives
living
lobby
lock
locked
locker
lockers
london
long
looking
looks
lost
lot
loud
loves
lunch
made
magazine
mailbox
make
makes
makeup
making
man
manager
marry
mary
matter
may
me
mean
measuring
meat
mechanic
medicine
meet
meeting
men
menu
menus
message
mexico
miles
milk
mine
minutes
month
moon
mop
more
most
mother
motorboats
motorcycle
mountain
mountains
move
moved
movie
mr.
ms.
much
mushrooms
music
my
naomi
necklace
needs
new
nine
nor
number
off
ogpin
old
once
onions
orange
out
oven
paintings
pants
parents
paris
parking
party
passed
passing
pasta
pay
paying
pen
people
person
phone
phones
photo
photos
piano
pianos
pick
picking
pie
pink
pipe
pipes
pirelli
pizza
place
plant
plants
plate
plates
play
player
players
playing
plumber
post
pot
puts
puzzle
rain
reading
ready
rebecca
receive
received
red
refrigerator
repair
repairing
repeat
replace
return
returns
reynolds
rice
richardson
ride
riding
right
rings
river
rode
rome
roof
roofs
room
rope
ropes
rose
rowboat
rowboats
ruins
run
running
russia
russian
sad
said
sailboat
sailed
salad
salt
same
sandwich
sandwiches
sara
sat
saturday
saturdays
sauce
saw
say
says
school
scientist
seafood
seated
second
section
see
sees
sell
sells
send
sent
seven
seventy
sew
sewing
sews
share
sharing
shave
shaved
shaving
she
she’ll
sheet
sheets
shirt
shoes
short
should
show
sick
sign
signing
signs
silk
silom
silver
since
sink
sister
sisters
sit
sits
sitting
six
sixteenth
small
soccer
sometimes
sons
south
spoons
stamp
stamps
standing
staying
still
stir
stirring
stirs
stop
stoplight
stopped
stopping
store
straight
street
student
students
study
studying
sugar
suit
suitcase
suitcases
suits
sunday
surprise
surprised
sweater
swimming
swollen
table
take
taken
taking
tanaka
taste
taught
teach
teacher
teaching
team
television
temperature
temple
ten
tent
tenth
than
thank
that
that’s
the
theater
their
them
then
there
there’s
these
they
they’ll
they’re
think
thinks
third
thirsty
this
those
thought
thousand
three
throw
tickets
tie
tiger
tigers
time
times
tip
tire
tired
tires
to
today
tomato
tomatoes
tonight
too
tore
torn
tours
toys
trash
trying
turned
umbrella
united
until
us
used
uses
using
van
very
violins
visit
visiting
volcano
wait
waiting
waitress
walk
walking
wall
wallet
want
was
watch
watched
watches
watching
water
waterfalls
we
we’ll
we’ve
wear
website
wedding
wednesday
week
welcome
well
went
were
what
what’s
when
where
while
who
why
wife
win
window
windows
winning
winter
wire
wires
with
without
woke
woman
won’t
woods
wool
words
wore
work
worker
working
works
worried
worry
would
wrenches
writing
written
wrong
year
years
yellow
yes
yesterday
you
you’ll
you’re
your
yours
