a
adults
after
afternoon
am
an
and
animals
anna
anne
apartment
apple
apples
are
australia
babies
baby
bad
bakery
ball
balls
because
bed
beds
before
beijing
belts
bicycle
bicycles
big
bigger
biggest
black
blond
blue
book
books
bowl
bowls
boy
boys
bread
breakfast
bridge
broken
brother
brown
brush
brushing
but
buying
cake
car
card
carrot
carrots
cars
cash
cat
cats
chair
chairs
check
checks
child
children
chinese
chocolate
city
clark
clean
closed
clothes
coat
coffee
coins
cold
color
colors
comes
computer
computers
concert
cook
cooking
cost
country
credit
cup
dan
daughter
david
day
days
desktop
different
dining
dinner
dirty
do
doctor
doctors
does
doesn’t
dog
dogs
doing
dollars
don’t
door
drink
drinking
drinks
driving
dry
eat
eating
egg
egypt
eight
eight
eighteen
eleven
elm
english
euros
evening
excuse
face
faces
fall
family
fast
faster
father
fifty
fine
fingers
fish
fit
fits
five
flower
flowers
foot
forty
four
france
friday
friend
from
fruit
game
girl
girls
glasses
golf
good
goodbye
grandma
grandmother
grass
gray
green
guest
guests
haddad
hair
hand
hands
hardware
has
hat
have
he
he’s
heavy
hello
his
horse
horses
hospital
hotel
house
how
hugging
hungry
husband
i
i’m
in
inside
is
isabella
it
it’s
italy
jane
japan
jeans
jewelry
john
jones
juice
keys
kitchen
laptop
least
less
levy
li
light
lighter
lightest
like
likes
lima
lin
listen
listening
live
lives
living
loves
lunch
man
many
me
meat
medicine
meet
men
metal
michael
mike
milk
mom
monday
movie
name
new
night
nineteen
none
of
older
open
outside
parker
people
pink
play
police
pounds
radio
reads
reem
rome
run
russia
same
sandwich
sandwiches
sarah
school
sells
seven
she
she’s
sheet
sheets
shirt
shoe
shoes
short
sink
sister
sitting
sixteen
sixty
size
sizes
skirt
sky
sleeping
slow
slower
small
smallest
smell
smells
smith
soap
soccer
socks
son
sons
speak
speaking
speaks
spring
standing
store
street
street
student
students
studying
sue
suit
suits
summer
sun
sunday
sunglasses
sweater
swim
swimming
t-shirt
t-shirts
table
tables
tall
taste
tastes
taylor
tea
teacher
teaching
teeth
television
ten
than
thank
the
their
them
there
these
thirsty
thursday
tired
too
toys
umbrella
united
vegetables
watches
watching
we’re
wearing
welcome
wet
what
when
where
white
who
why
window
winter
with
wooden
work
works
write
writing
years
yellow
yes
you
you’re
younger
youngest
your
a
able
address
adult
adults
after
ahead
airplane
airport
am
an
ancient
and
animal
answering
any
apartment
apple
apples
april
are
arrive
arrives
arriving
art
at
ate
august
australia
baby
bakery
ball
bank
beach
beans
because
bed
beef
before
begin
beginning
begins
behind
beijing
bernard
beside
bethany
better
bicycle
big
biggest
birthday
blankets
blond
blue
bookstore
bought
boy
boys
breakfast
bring
brother
brought
building
bus
busy
but
butter
buy
buying
cafe
cake
call
calling
camera
camp
camping
can
car
carrots
cars
cash
cat
cats
cell
chair
chairs
chicken
child
children
china
chocolate
church
city
clean
clock
clothes
cloudy
coat
coffee
cold
college
come
coming
concert
cooked
cooking
cost
costs
country
credit
crying
cup
dance
dancer’s
dancers
dances
dancing
daughter
day
days
december
departs
desk
dessert
desserts
dictionary
did
didn’t
dinner
dirty
do
doctor
doctor’s
does
dog
doing
dollars
don’t
door
down
downtown
drank
dress
dresses
drink
drinking
drive
drives
driving
drove
drum
drums
e-mail
e-mails
early
eat
eating
eight
eighteen
eighty
elena
eleven
employees
end
ending
ends
english
euros
evening
excuse
expensive
factory
fairfield
families
family
far
fast
father
fifteen
fifteenth
fifth
fifty
finally
find
fine
first
fish
five
flight
flowers
foot
for
forty
foster
found
fountain
four
fourth
france
free
friday
friends
fruits
game
games
gas
gave
get
getting
girl
girls
give
gives
giving
glasses
go
goes
going
good
goodbye
grandfather
grandmother’s
grass
gray
green
guitars
had
hair
hand
hands
happy
hardware
has
have
he
he’s
hello
her
here
hi
high
hill
him
his
home
horse
hospital
hotel
hour
hours
house
hungry
husband
i
i’m
in
inside
instrument
instruments
is
island
islands
it
it’s
italy
january
japan
jean
jeans
jewelry
john
john’s
jones
juice
july
june
keys
kissed
kitchen
knife
know
ladder
lake
last
late
laura
laura’s
leaving
left
letter
letters
like
liked
likes
lime
line
listen
live
lives
living
long
looking
lost
lot
lunch
make
making
man
manager
map
march
math
means
medicine
men
mile
miles
mom
monday
month
moon
more
morning
mosque
most
mother
mountains
mr
museum
musician
name
new
night
notebook
number
ocean
office
old
oldest
on
one
or
orange
oranges
our
outside
p.m.
packed
packing
painting
paintings
parents
party
passport
pay
pen
person
pharmacy
phone
photo
photos
piano
plate
plates
play
plays
police
potato
rain
reading
rent
restroom
robert
russia
sail
salad
salt
same
sandwich
sandwiches
sarah
saturday
school
science
seat
second
seconds
see
sell
selling
september
seven
she
she’s
she’s
sheet
shirt
shoe
shoes
sign
sing
singer
singing
sings
sink
sister
sit
sitting
sixty
ski
skiers
skiing
skirt
sky
sleeping
slow
small
smiling
smith
smith’s
snow
snowing
soap
soccer
sock
socks
sold
some
something
sorry
soup
sour
speak
stadium
stairs
stamps
standing
start
starts
station
statue
statues
stay
staying
stop
store
straight
street
student
students
studies
study
studying
sue
sugar
suit
suitcase
suitcases
suits
summer
sunglasses
sunny
swim
swimming
swimsuit
swimsuits
synagogue
t-shirt
t-shirts
table
taking
talk
talking
tall
taught
taxi
tea
teach
teacher
television
temple
temples
ten
tennis
thank
that
the
their
them
then
there
these
they
they’re
thirsty
thirteenth
thirty
this
those
thousand
three
thursday
tickets
time
to
tomorrow
towel
tree
turning
types
unpacking
used
wait
walking
wants
wash
watched
we
we’re
wear
wearing
week
welcome
well
went
were
wet
what
what’s
when
where
which
white
why
wife
will
windy
winter
with
woman
women
woods
word
words
work
working
works
worse
worst
would
write
writes
writing
wrote
year
years
yellow
yen
yes
yesterday
you
you’re
younger
your
zoo
a
about
add
added
adding
address
adults
afraid
africa
again
ago
airplane
airport
alex
all
almost
already
also
always
am
an
and
animal
animals
answering
antarctica
any
apple
arabic
arctic
are
arm
as
atlantic
australia
baby’s
bake
balls
bean
bed
before
begins
behind
beijing
believe
beside
better
bicycle
big
bigger
bird
birds
birthday
black
books
boring
born
box
boyfriend
brazil
bread
bring
brother
brought
build
building
built
bus
businessman
businessmen
businesswoman
businesswomen
but
butter
buy
by
cafe
cake
called
camels
camera
cameras
camp
can
can’t
car
careful
carrots
carry
cash
cat
catch
catches
caught
cell
chair
chairs
cheese
chicken
child
children
china
choosing
chose
christian
church
city
clean
cleaned
cleaner
cleaning
climb
climbing
clock
closed
clothes
coat
coats
coffee
cold
college
come
coming
company
computer
computers
concert
condolences
congratulations
continent
continents
cook
cooking
cooks
cost
couch
counter
country
cow
cows
cup
cups
cut
cutting
dad
dad
dance
dances
dancing
daniel
daughter
day
days
dead
degrees
delayed
depart
departed
departs
desert
dessert
dictionary
did
different
difficult
dinner
dirty
disagree
discovered
dishes
do
doctor
doctor’s
dodd
does
doesn’t
dog
dogs
doing
don’t
door
downtown
dress
drink
drinking
drive
driven
drove
drums
drunk
duck
ducks
during
e-mails
each
early
east
eastern
easy
eat
eaten
eating
eats
eggs
egypt
eight
eighty
elbows
election
elephant
elephants
eleven
emily
empty
ended
english
enough
euros
ever
everyone
exchange
exchanged
excuse
exercise
exercises
exercising
eye
eyes
face
fall
families
family
far
fast
faster
father
fell
fifteen
fifty
finally
find
finger
finish
finished
fire
first
fit
fits
five
flags
flashlight
flight
floor
flower
flowers
flying
food
for
forest
forgot
forgotten
fork
forks
forty
fought
found
four
france
frank
free
french
fresh
friday
friend
frog
from
frozen
fruit
full
funeral
game
games
garden
gave
german
germans
germany
get
getting
girl
girlfriend
girls
give
gives
glass
go
going
golf
good
got
grandfather
grandparents
grass
gray
green
grocery
grow
growing
grows
guests
guitar
hair
half
hammer
hammers
hands
happened
happy
has
hat
have
head
heads
hello
help
helping
her
here
hers
hi
him
his
hold
holding
holidays
home
hope
hopes
horse
hospital
hot
hours
house
how
hundred
hungry
hurts
i’m
ice
if
in
inches
india
indian
insects
inside
into
is
island
it
it’s
italian
italians
italy
jane
japan
jeans
jewelry
joel
johann
john
juice
julia
july
jump
jumped
jumping
key
keys
king
king’s
kitchen
knee
knees
knife
know
knows
ladder
lake
language
languages
laptop
last
learn
learning
least
leave
leaving
left
leg
legs
lemon
less
letter
letters
library
like
liked
likes
limes
line
listen
listening
little
lived
long
look
looks
lose
losing
lost
louise
love
lunch
made
make
making
man’s
manager
many
maria
maria’s
married
math
maybe
me
measuring
meat
medicine
meet
met
mexican
mexicans
mexico
milk
mom
monday
money
monkey
monkeys
month
months
moon
more
mosque
most
mother
mothers
mountain
mountains
mouth
movie
much
museum
music
muslim
my
nail
nails
name
near
needs
never
new
nice
north
nothing
number
off
okay
once
ones
onto
oranges
ours
pacific
packing
paintings
passport
pepper
photos
pizza
plays
police
potatoes
pounds
putting
rained
ready
refrigerator
repaired
riding
rosetta
rugs
run
said
salt
sand
scale
science
sell
seventy
shark
sharks
she
she’s
sheet
sheets
shirt
shoe
shoes
shopping
short
should
shower
sign
since
sink
sits
sitting
sixty
size
ski
skirts
skis
sleeping
slice
slices
small
smallest
smell
smells
smith
snake
snakes
snow
sock
someday
sometimes
son’s
south
spain
speaking
statues
studying
sue
sugar
suit
suitcase
sunglasses
sunny
suzanne
sweater
sweep
sweet
swept
swim
swimming
table
take
taken
taking
talk
talked
talking
tall
tape
taste
tastes
taught
taxis
taylor
tea
teach
teacher
teaching
team
teaspoons
teeth
television
temple
tennis
tent
than
thank
that
that’s
the
the
theater
them
then
there
there’s
thermometer
these
they’re
think
thinks
third
thirds
thirsty
thirty
this
those
thousand
three
throw
tiger
tigers
time
times
tired
to
today
toilet
tom
tomato
tomatoes
tomorrow
touch
touching
towel
toy
toys
train
trash
tree
twelve
twenty
types
under
united
using
violin
vote
wants
wash
water
we’re
wearing
wednesday
weeks
went
west
wheeler
while
whole
wide
wilson
win
winning
wins
winter
woman
woman’s
women
won
woods
work
working
works
worn
would
wrench
writing
written
wrong
wrote
year
years
yen
yes
yesterday
you
you’re
your
yours
a
anderson
andy
angry
animal
animals
antarctica
any
anything
anyway
apartment
apple
apples
appointment
architect
architects
are
aren’t
arm
arrived
art
arthur
artist
asia
ask
ate
australia
babies
baby
bad
badly
baked
baking
a.m.
able
about
achoo
actor
actress
add
address
adult
adults
afraid
africa
after
ago
airplane
airplanes
airport
airports
alejo
alice
all
allergic
almost
alone
already
although
always
american
an
ancient
and
balcony
banana
bananas
band
barcelona
baseball
basketball
bath
bathroom
battery
be
beans
beard
beards
beautiful
because
bed
bedran
bedroom
been
before
begin
begins
begun
behind
benjamin
best
beth
bicycle
bill
bird
birthday
blanket
bless
blocks
blond
blue
boards
boat
boiled
boiling
book
boot
boots
bored
born
both
bottle
bottles
bought
bowls
box
boxes
boy
boys
bracelet
bracelets
brazil
bread
breakfast
bridge
bridges
bring
bringing
brings
brochure
broke
brother
brothers
brought
bucket
build
building
buildings
built
burn
burned
burning
bus
but
butter
button
buttoned
buttoning
buy
by
cabinets
cafe
cake
calling
came
can
can’t
car
card
careful
carrying
cars
cast
castle
cat
catch
catherine
cats
caught
cave
caves
ceiling
celebrate
celebrating
cell
century
cereal
chair
charge
charged
charging
check
chicken
children
choosing
church
churches
cindy
city
clark
clean
cleaners
client
climb
climbing
clock
close
closed
closet
closing
clothes
coming
cooking
cost
crying
cut
da
dairy
date
day
degrees
delivery
desert
design
designs
did
didn’t
dinner
dirty
dishes
do
doctor
does
dog
dogs
doll
dollars
dolls
don’t
door
down
draw
drawer
drawing
drawn
dress
dresses
drew
drink
drinking
drive
drives
driving
drove
drunk
dry
dry
dryer
ducks
during
dye
dyed
dying
e-mail
ear
earrings
eat
eating
egg
eggs
eight
either
elbow
elevator
ellis
embarrassed
emi
employee
employees
empty
engine
engineer
english
enter
entering
envelope
escalator
escalators
europe
euros
evening
everyone
excuse
exiting
expensive
exploring
eye
face
falls
family
far
faster
father
favorite
feldmann
fell
festival
festival
fever
fields
fifteen
fifty
fighting
finally
find
fine
fingers
finish
finished
fireplace
first
fish
fishing
five
flashlight
flashlights
flat
floor
flowers
folded
folding
follow
following
food
for
forest
forget
forgot
found
four
fourth
france
french
fresh
friday
fried
friend
from
frozen
fruit
frying
full
fun
game
games
garden
gardens
garlic
gave
germany
get
gift
girl
girlfriend
give
gives
giving
glass
glasses
glove
gloves
go
goes
going
gold
golf
good
got
grandfather
gray
green
grilled
grilling
grocery
guest
guide
guitars
gunther
had
hair
half
hand
hands
hanging
hangs
happen
happened
happy
has
hat
have
he
he’s
headphones
heal
healed
healing
heals
hears
hello
helmets
help
her
here
hi
hiking
him
hiro
his
history
hobbies
hobby
hockey
home
hood
hope
horse
horses
hospital
hot
hotel
hour
hours
house
how
hungry
hurt
hurts
husband
i
isn’t
it
it’ll
it’s
italian
italy
its
jack
jacket
jackets
james
january
japan
japanese
jeff
jewelry
jill
job
john
juice
julia
jump
jumped
jumping
june
just
key
keys
kilometers
kings
kingston
kissed
kitchen
kites
knee
knife
knives
i’m
i’ve
i’ve
ice
idea
if
important
in
incorrectly
insect
insects
inside
instead
interesting
intersection
into
iron
ironed
ironing
irons
is
know
knows
label
ladder
lake
lamb
lamp
laptop
last
laugh
leak
leaking
learn
leather
leave
leaves
leaving
left
lemon
lens
lenses
leonardo
less
let’s
libraries
library
light
like
liked
likes
listening
live
lived
lives
living
lobby
lock
locked
locker
lockers
london
long
looking
looks
lost
lot
loud
loves
lunch
made
magazine
mailbox
make
makes
makeup
making
man
manager
marry
mary
matter
may
me
mean
measuring
meat
mechanic
medicine
meet
meeting
men
menu
menus
message
mexico
miles
milk
mine
minutes
month
moon
mop
more
most
mother
motorboats
motorcycle
mountain
mountains
move
moved
movie
mr.
ms.
much
mushrooms
music
my
naomi
necklace
needs
new
nine
nor
number
off
ogpin
old
once
onions
orange
out
oven
paintings
pants
parents
paris
parking
party
passed
passing
pasta
pay
paying
pen
people
person
phone
phones
photo
photos
piano
pianos
pick
picking
pie
pink
pipe
pipes
pirelli
pizza
place
plant
plants
plate
plates
play
player
players
playing
plumber
post
pot
puts
puzzle
rain
reading
ready
rebecca
receive
received
red
refrigerator
repair
repairing
repeat
replace
return
returns
reynolds
rice
richardson
ride
riding
right
rings
river
rode
rome
roof
roofs
room
rope
ropes
rose
rowboat
rowboats
ruins
run
running
russia
russian
sad
said
sailboat
sailed
salad
salt
same
sandwich
sandwiches
sara
sat
saturday
saturdays
sauce
saw
say
says
school
scientist
seafood
seated
second
section
see
sees
sell
sells
send
sent
seven
seventy
sew
sewing
sews
share
sharing
shave
shaved
shaving
she
she’ll
sheet
sheets
shirt
shoes
short
should
show
sick
sign
signing
signs
silk
silom
silver
since
sink
sister
sisters
sit
sits
sitting
six
sixteenth
small
soccer
sometimes
sons
south
spoons
stamp
stamps
standing
staying
still
stir
stirring
stirs
stop
stoplight
stopped
stopping
store
straight
street
student
students
study
studying
sugar
suit
suitcase
suitcases
suits
sunday
surprise
surprised
sweater
swimming
swollen
table
take
taken
taking
tanaka
taste
taught
teach
teacher
teaching
team
television
temperature
temple
ten
tent
tenth
than
thank
that
that’s
the
theater
their
them
then
there
there’s
these
they
they’ll
they’re
think
thinks
third
thirsty
this
those
thought
thousand
three
throw
tickets
tie
tiger
tigers
time
times
tip
tire
tired
tires
to
today
tomato
tomatoes
tonight
too
tore
torn
tours
toys
trash
trying
turned
umbrella
united
until
us
used
uses
using
van
very
violins
visit
visiting
volcano
wait
waiting
waitress
walk
walking
wall
wallet
want
was
watch
watched
watches
watching
water
waterfalls
we
we’ll
we’ve
wear
website
wedding
wednesday
week
welcome
well
went
were
what
what’s
when
where
while
who
why
wife
win
window
windows
winning
winter
wire
wires
with
without
woke
woman
won’t
woods
wool
words
wore
work
worker
working
works
worried
worry
would
wrenches
writing
written
wrong
year
years
yellow
yes
yesterday
you
you’ll
you’re
your
yours
a
ancient
and
angry
animal
animals
another
answer
any
anymore
apples
are
aren’t
arm
art
artificial
as
ask
asked
asking
assignment
astronomy
about
accident
actor
add
adding
address
adult
afraid
after
ago
ahead
airplane
airplanes
airport
all
almost
alone
already
always
am
ambulance
american
amount
an
atlantic
back
badly
basket
beautiful
become
bee
been
bees
before
begun
behind
being
belt
benson
between
bicycle
big
biography
biology
bit
bite
biting
black
blizzard
blocks
blond
blue
bob
bone
bones
book
books
boots
born
borrow
borrowed
both
bottles
bought
boxes
boy
boys
brain
brazil
bread
breaking
breathe
breathing
brick
bridge
bring
bringing
british
brochure
brochures
broke
broken
brothers
brought
brown
build
built
bulldozer
bulldozers
burned
burning
burns
business
businessman
businessmen
busy
but
butter
buy
by
cake
calculator
call
calling
came
camera
camp
camping
can
can’t
canceled
canceling
cans
car
careful
carrot
carry
carrying
cars
cart
carts
cash
cast
cat
cats
cave
cell
cells
century
chair
change
changed
changes
chapter
chapters
cheat
cheating
check
checked
checking
cheese
chemist
chemistry
chicken
chickens
child
children
chinese
choked
choking
citizen
citizens
class
clean
clear
clerk
clerks
climbed
climbing
closed
clothes
cloudy
coal
coat
coffee
college
collided
color
colors
come
comedy
comes
coming
complex
computer
concert
confused
congratulations
continents
cook
cooking
corn
cost
costs
couch
could
countries
course
cousin
cousins
crane
cranes
cream
cry
culture
cup
curly
customer
customers
cut
dad
damage
damaged
dangerous
dark
date
day
decreased
degrees
deliver
delivery
departed
department
departs
depend
depends
design
designs
desk
despite
destroyed
diamond
diamonds
did
didn’t
different
difficult
digging
dinner
dirt
dirty
discover
discovered
discovers
dishes
divide
dividing
divorced
do
doctor
doctors
does
dollars
dolls
don’t
donate
donating
done
donkey
donkeys
door
doubt
down
downtown
drawing
dress
dresses
drink
drive
driving
dropped
drought
drunk
dryer
duck
ducks
due
during
each
earlier
early
earth
earth
earthquakes
easy
eat
eating
egg
eggs
eight
eighteenth
eighty
either
election
electrical
electricity
elephant
elevator
embarrassed
embassy
embassy
emergencies
emergency
employees
end
energy
engine
english
enjoys
enough
entering
entrance
europe
european
euros
evening
ever
everest
every
everyone
exam
excellent
except
excited
excuse
exercises
exit
exits
expensive
experiments
explore
explored
extinguisher
extra
eyes
face
factories
factory
fail
failed
fall
family
famous
far
farm
farmer
farmers
fashion
fast
fastest
father
feed
feeding
feel
feet
fell
felt
fever
feverish
few
fiction
fifteen
fifty
fighting
find
fine
finger
finish
finished
finishes
fire
fireplace
fires
first
fishing
fit
five
flag
flat
flight
flood
floor
flour
flower
flowers
fly
folded
follow
followed
follows
food
for
forest
forget
forgot
forklift
forklifts
fortunate
fortunately
found
four
fourteen
fourth
france
french
fresh
friday
friend
friends
frog
from
front
full
fun
funny
future
game
garden
german
germany
get
gift
girl
give
giving
glass
go
goat
goats
going
gold
golf
gone
good
got
graduate
graduated
grandchildren
grandmother
grandson
grass
green
grocery
group
groups
grow
grown
grows
guitar
gwen
had
hair
hand
hands
happen
happened
happens
happy
harvest
has
hasn’t
have
haven’t
he’ll
he’s
head
heal
healed
hear
heavy
helicopter
hello
help
helping
helps
her
here
here’s
high
hiking
hill
him
history
hobbies
hobby
hockey
hold
holding
home
honey
hope
horses
hospital
hotel
hours
house
houses
how
hundred
hungry
hurricane
hurt
hurts
husband
i
i’ll
i’m
i’ve
ice
idea
if
illegal
imagine
imagined
imagines
imagining
important
in
inch
inches
india
industry
information
injection
injections
injury
insects
inside
instead
interested
interesting
into
is
islands
isn’t
it
it’ll
it’s
italian
jane
january
japan
japanese
jeans
joan
job
john
josephine
josh
juice
julia
july
jump
just
keys
kitchen
knee
know
laboratory
lake
lamp
larson
last
late
later
laugh
law
lawyer
lawyers
leaking
learn
least
leaving
left
leg
lemons
lending
lent
less
let’s
lets
letter
library
lie
life
lifting
light
lights
like
liked
likes
listen
listening
little
live
lived
lives
living
load
loaded
loading
locked
london
long
look
looked
looking
looks
lose
lost
lot
loves
lumber
lunch
made
make
makes
making
mall
man
managers
manufacture
manufactured
manufactures
manufacturing
many
maps
market
married
marry
mary
math
matter
maybe
means
medicine
medium
mediums
meet
meeting
men
met
mexico
microscope
microscopes
midnight
might
milk
mining
minor
minutes
mirror
miss
mistake
mistakes
modern
money
month
months
moon
more
morning
moscow
most
mother
mountain
move
moved
movies
multiply
name
necklace
needs
new
nice
nineteenth
no
noon
nor
normal
not
nothing
novel
now
number
nurses
nuts
ocean
of
off
officer
often
oil
okay
on
one
only
onto
opens
or
oranges
order
ordered
other
our
outside
over
owned
owns
package
packages
page
pages
paint
painting
pants
paper
paramedic
paramedics
parents
paris
park
part
parts
party
passed
passenger
passengers
passport
past
pasta
patient
patients
pay
paying
peace
pencils
penguin
people
person
phone
photo
photographer
photography
photos
piano
pilot
pipes
place
plan
plane
planet
planning
plant
plants
plate
plates
play
played
plays
plumber
police
pork
problems
produced
psychology
pull
pulling
purse
push
pushing
put
puzzle
question
questions
race
radio
rain
rained
raise
raises
rarely
rash
read
real
realized
really
receipt
received
receiving
receptionist
recommend
recycle
recycled
recycling
red
register
remarried
remember
remembered
rent
renting
repair
repairing
replace
represent
representative
represented
represents
reservations
restaurant
return
rice
ride
right
ripe
romance
romantic
roof
room
run
running
runs
russia
russian
sad
safe
safer
said
sailing
salad
sale
same
sand
sandwich
saturday
sauce
save
saved
saves
saving
saw
says
scary
school
science
scientists
screaming
sculpting
sculptor
sculpture
seafood
see
seeds
sees
sell
sells
serious
seventy
share
shared
sharing
shark
shave
shaving
she
she’ll
she’s
ship
shirt
shoes
shop
shopping
should
shovel
show
showing
sick
side
sign
signs
simple
since
singer
singers
singing
single
sink
sirius
sister
sit
sitting
six
size
ski
skiers
skiing
sleep
sleeping
slept
slice
small
smiling
smoke
snake
snow
snowing
so
soccer
socks
soda
soldier
soldiers
solve
solved
solving
some
someday
something
son
soon
sorry
soup
speaks
spend
spent
spilled
spilling
spring
star
stars
start
started
starting
starts
statue
statues
stay
steal
stealing
steel
still
stole
stolen
stop
stopped
stops
store
stories
story
straight
street
strong
student
students
studied
studies
study
studying
suitcase
suitcases
summer
sunday
sunglasses
sunny
sunrise
sunset
surprised
susan
swim
take
taken
takes
taking
talking
tall
tanaka
taste
taught
taylor
tea
teach
teacher
teaches
teaching
team
teeth
telescope
television
telling
temperature
ten
tennis
than
thank
that
that’s
the
theater
their
them
then
there
there’s
these
they
they’ll
they’re
thief
thieves
think
thinks
third
thirty
this
those
thought
three
through
ticket
tigers
tigers
time
times
tired
to
toys
tractor
tractors
traditional
train
translate
translates
translating
translator
transport
transportation
transporting
trash
traveled
traveling
treat
treated
treating
tree
tried
truck
trucks
truth
try
trying
turning
twelve
twenty
twin
twins
two
type
types
unclear
uncles
under
together
told
tomato
tomatoes
tomorrow
too
toothpaste
torn
tornado
touching
tour
toy
understand
unless
uses
vacations
video
visits
waitress
wants
war
wars
was
washing
wasn’t
watch
watches
watching
we
we’re
wear
wears
weather
week
weeks
welcome
well
went
weren’t
wet
whale
what
what’s
wheat
when
where
where’s
which
while
who
why
wife
will
williams
wilson
win
window
windy
winning
wins
winter
wires
with
woke
woman
women
won
won’t
wood
woods
words
wore
work
worked
worker
workers
working
worn
worried
worry
would
wouldn’t
written
x-ray
x-rays
yard
year
years
yes
without
yesterday
you
you’ll
you’ve
young
younger
youngest
your
zoo
